package com.wxy.demo01;

public class GC01 {
//    seriol:为单线程环境设计并使用一个线程进行垃圾回收,
//    暂停所有的用户线程
//    不适合服务器环境
//    这里面局限性
//    什么意思:
//    关键字
//    这里面空间已经是满了,这里面的话就要满了,现在的话,
//    用餐打扫卫生
//    高并发服务器,这里面的话就会亏损状态
//    parallel:多线程进行来集回收
//    性能比前面的要好
//    简单的理解就多个线程进行回收
//    并发垃圾回收
//    后面的话就是同时执行
//    这里面是交互前台不能停
//     这里面他所具备的资源是非常的丰富的,这里面就会涉及到了一些问题
//    比如学费的问题,还有就是住宿费的问题,还有生活费的问题
//      这里面超过了垃圾回收的空间的话,这里面的话就会触发垃圾回收机制
//    concurrent:并发
//    前面的都是不支持用户线程的执行,第二个就是前面seriol的增强
//    第四种
//    seriol:垃圾收集器,同时为了单线程而设计的,单线程垃圾回收器,在垃圾回收的时候
}
